/*===============================================================
 *   Copyright (C) 2018 All rights reserved.
 *   
 *   文件名称：show.c
 *   创 建 者：zhaoweilong
 *   创建日期：2018年10月29日
 *   描    述：
 *
 *   更新日志：
 *
 ================================================================*/
#include "head.h"

void show_login()
{
	printf("/**********云app***************\n");
	printf("******** 1: <登录>*************\n");
	printf("******** 2: <注册>************\n");
	printf("*****************************/\n");
}
void show_file_menu()
{
	printf("/*************文件服务********************\n");
	printf("********下载命令：get+文件名**************\n");
	printf("********上传命令：put+文件名**************\n");
	printf("********删除命令：del+文件名**************\n");
	printf("********分享命令: share+文件名>用户名*****\n");
	printf("********查看本地文件: ls *****************\n");
	printf("********查看云文件：show *****************\n");
	printf("********退出服务：quit *******************\n");
	printf("********帮助命令: help *******************\n");
	printf("******** ********************************/\n");
}
void show_menu()
{
	printf("/**********菜单*******************\n");
	printf("******** 1: <修改资料>************\n");
	printf("******** 2: <文件服务>************\n");
	printf("******** 3: <注销帐号>************\n");
	printf("******** 4: <退出程序>************\n");
	printf("*********************************/\n");

}
